UserService/app/controllers/api/v1/users_controller.rb

      def index
        users = User.order('created_ts DESC');
---
SELECT `users`.* FROM `users` ORDER BY created_ts DESC

      def show
        user = User.find_by_username(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'hello@gmail' LIMIT 1